src/Documents/ЗаказНаРемонт/ЗаказНаРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаРемонт</name>
  <registerRecords>AccumulationRegister.ТоварыКОтгрузке</registerRecords>
  <registerRecords>InformationRegister.ПланРемонтов</registerRecords>
  <registerRecords>InformationRegister.РемонтыРабочихЦентров</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>InformationRegister.ПериодыАктуальностиОбъектовЭксплуатации</registerRecords>
  <registerRecords>AccumulationRegister.ТрудозатратыКОформлению</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыИПотребности</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаВнутреннееПотребление</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектЭксплуатации</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийВидРемонта</name>
    <type>
      <types>CatalogRef.ОбщиеВидыРемонтов</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.Приоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>РемонтноеМероприятие</name>
    <type>
      <types>CatalogRef.РемонтныеМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеРабот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаФактическая</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияФактическая</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПотреблениеДляДеятельности</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехРешение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаказовНаРемонт</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступныТрудозатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКодРемонта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКодСтрокиНоменклатуры</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКодСтрокиТрудозатрат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоЗаказНаВнутреннееПотреблениеРабот</name>
    <comment>Технический признак того, что заказ формирует распоряжения на внутреннее потребление работ.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ремонты</name>
    <attributes>
      <name>Узел</name>
      <type>
        <types>CatalogRef.УзлыОбъектовЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>РемонтныйЦикл</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>КодРемонта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособОтраженияЗарплаты</name>
      <type>
        <types>CatalogRef.СпособыОтраженияЗарплатыВБухУчете</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериалыИРаботы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <type>
        <types>EnumRef.ВариантыОбеспечения</types>
      </type>
    </attributes>
    <attributes>
      <name>КодРемонта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Обособленно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспеченияДоИзмененияОбновлениемИБ</name>
      <type>
        <types>EnumRef.ВариантыОбеспечения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РабочиеЦентры</name>
    <attributes>
      <name>РабочийЦентр</name>
      <type>
        <types>CatalogRef.РабочиеЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗавершения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УстраняемыеДефекты</name>
    <attributes>
      <name>Дефект</name>
      <type>
        <types>DocumentRef.РегистрацияДефекта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Трудозатраты</name>
    <attributes>
      <name>ВидРабот</name>
      <type>
        <types>CatalogRef.ВидыРаботСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Бригада</name>
      <type>
        <types>CatalogRef.Бригады</types>
      </type>
    </attributes>
    <attributes>
      <name>КодРемонта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/ВидыРемонтов/ВидыРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыРемонтов</name>
  <owners>Catalog.КлассыОбъектовЭксплуатации</owners>
  <attributes>
    <name>ОбщийВидРемонта</name>
    <type>
      <types>CatalogRef.ОбщиеВидыРемонтов</types>
    </type>
  </attributes>
  <attributes>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияДлительности</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастотаПланирования</name>
    <type>
      <types>EnumRef.ЧастотаПланированияРемонтов</types>
    </type>
  </attributes>
  <attributes>
    <name>Упреждение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьГрафикРаботы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>МатериалыИРаботы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Трудозатраты</name>
    <attributes>
      <name>ВидРабот</name>
      <type>
        <types>CatalogRef.ВидыРаботСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/ЗаказНаРемонт/Forms/ПодборМатериаловПоВидамРемонтов/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ПолучитьДанныеЗаказа();
	ЗаполнитьМатериалыИРаботы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность И ЕстьДанныеДляПереноса() Тогда
		
		ОповещениеСохранитьИЗакрыть = Новый ОписаниеОповещения(
			"ПередЗакрытиемПеренестиИЗакрыть", ЭтотОбъект);
	
		ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(
			ОповещениеСохранитьИЗакрыть,
			Отказ,
			ЗавершениеРаботы,
			НСтр("ru = 'Данные были изменены. Перенести в документ?';
				|en = 'Data has changed. Transfer to the document?'"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериалы

&НаКлиенте
Процедура МатериалыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	
	Если Поле = Элементы.МатериалыНоменклатура И ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(, ТекущиеДанные.Номенклатура);
		
	ИначеЕсли Поле = Элементы.МатериалыВидРемонта И ЗначениеЗаполнено(ТекущиеДанные.ВидРемонта) Тогда
		
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(, ТекущиеДанные.ВидРемонта);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоУпаковокПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц", Новый Структура("НужноОкруглять", Ложь));
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	Если ЕстьДанныеДляПереноса() Тогда
		
		ПеренестиМатериалыВДокумент();
		
	Иначе
		
		ОчиститьСообщения();
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Необходимо указать количество номенклатуры';
				|en = 'Specify the amount of products'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСтроки(Команда)
	УстановитьВыборСтрок(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьСтроки(Команда)
	УстановитьВыборСтрок(Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(
		ЭтотОбъект, "МатериалыНоменклатураЕдиницаИзмерения", "Материалы.Упаковка");
	
	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(
		ЭтотОбъект, "МатериалыХарактеристика", "Материалы.ХарактеристикиИспользуются");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМатериалыИРаботы()
	
	Модифицированность = Ложь;
	
	Материалы.Очистить();
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РемонтыЗаказа.ВидРемонта КАК ВидРемонта,
	|	РемонтыЗаказа.КодРемонта КАК КодРемонта
	|ПОМЕСТИТЬ РемонтыЗаказа
	|ИЗ
	|	&РемонтыЗаказа КАК РемонтыЗаказа
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидРемонта
	|;
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МатериалыИРаботыЗаказа.КодРемонта,
	|	МатериалыИРаботыЗаказа.Номенклатура,
	|	МатериалыИРаботыЗаказа.Характеристика,
	|	МатериалыИРаботыЗаказа.Упаковка,
	|	МатериалыИРаботыЗаказа.КоличествоУпаковок,
	|	МатериалыИРаботыЗаказа.Количество
	|ПОМЕСТИТЬ МатериалыИРаботыЗаказа
	|ИЗ
	|	&МатериалыИРаботыЗаказа КАК МатериалыИРаботыЗаказа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РемонтыЗаказа.КодРемонта КАК КодРемонта,
	|	МатериалыИРаботы.Ссылка КАК ВидРемонта,
	|	МатериалыИРаботы.Номенклатура,
	|	МатериалыИРаботы.Характеристика,
	|	МатериалыИРаботы.Упаковка,
	|	СУММА(МатериалыИРаботы.Количество) КАК Количество,
	|	СУММА(МатериалыИРаботы.КоличествоУпаковок) КАК КоличествоУпаковок
	|ПОМЕСТИТЬ МатериалыИРаботыПоВидамРемонтов
	|ИЗ
	|	Справочник.ВидыРемонтов.МатериалыИРаботы КАК МатериалыИРаботы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РемонтыЗаказа КАК РемонтыЗаказа
	|		ПО РемонтыЗаказа.ВидРемонта = МатериалыИРаботы.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РемонтыЗаказа.КодРемонта,
	|	МатериалыИРаботы.Ссылка,
	|	МатериалыИРаботы.Номенклатура,
	|	МатериалыИРаботы.Характеристика,
	|	МатериалыИРаботы.Упаковка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МатериалыИРаботыПоВидамРемонтов.КодРемонта КАК КодРемонта,
	|	МатериалыИРаботыПоВидамРемонтов.ВидРемонта КАК ВидРемонта,
	|	МатериалыИРаботыПоВидамРемонтов.Номенклатура КАК Номенклатура,
	|	МатериалыИРаботыПоВидамРемонтов.Характеристика КАК Характеристика,
	|	МатериалыИРаботыПоВидамРемонтов.Упаковка КАК Упаковка,
	|
	|	ИСТИНА КАК СтрокаВыбрана,
	|	МатериалыИРаботыПоВидамРемонтов.Количество КАК Количество,
	|	МатериалыИРаботыПоВидамРемонтов.КоличествоУпаковок КАК КоличествоУпаковок,
	|
	|	ЕСТЬNULL(МатериалыИРаботыЗаказа.КоличествоУпаковок, 0) КАК КоличествоУпаковокВЗаказе,
	|	МатериалыИРаботыПоВидамРемонтов.КоличествоУпаковок КАК КоличествоУпаковокВВидеРемонта
	|
	|ИЗ
	|	МатериалыИРаботыПоВидамРемонтов КАК МатериалыИРаботыПоВидамРемонтов
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ МатериалыИРаботыЗаказа КАК МатериалыИРаботыЗаказа
	|		ПО МатериалыИРаботыЗаказа.Номенклатура = МатериалыИРаботыПоВидамРемонтов.Номенклатура
	|			И МатериалыИРаботыЗаказа.Характеристика = МатериалыИРаботыПоВидамРемонтов.Характеристика
	|			И МатериалыИРаботыЗаказа.Упаковка = МатериалыИРаботыПоВидамРемонтов.Упаковка
	|			И МатериалыИРаботыЗаказа.КодРемонта = МатериалыИРаботыПоВидамРемонтов.КодРемонта
	|
	|ГДЕ
	|	ЕСТЬNULL(МатериалыИРаботыЗаказа.Количество, 0) <> МатериалыИРаботыПоВидамРемонтов.Количество
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МатериалыИРаботыЗаказа.КодРемонта КАК КодРемонта,
	|	РемонтыЗаказа.ВидРемонта КАК ВидРемонта,
	|	МатериалыИРаботыЗаказа.Номенклатура КАК Номенклатура,
	|	МатериалыИРаботыЗаказа.Характеристика КАК Характеристика,
	|	МатериалыИРаботыЗаказа.Упаковка КАК Упаковка,
	|
	|	ИСТИНА КАК СтрокаВыбрана,
	|	0 КАК Количество,
	|	0 КАК КоличествоУпаковок,
	|
	|	МатериалыИРаботыЗаказа.КоличествоУпаковок КАК КоличествоУпаковокВЗаказе,
	|	0 КАК КоличествоУпаковокВВидеРемонта
	|
	|ИЗ
	|	МатериалыИРаботыЗаказа КАК МатериалыИРаботыЗаказа
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РемонтыЗаказа КАК РемонтыЗаказа
	|		ПО РемонтыЗаказа.КодРемонта = МатериалыИРаботыЗаказа.КодРемонта
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ МатериалыИРаботыПоВидамРемонтов КАК МатериалыИРаботыПоВидамРемонтов
	|		ПО МатериалыИРаботыПоВидамРемонтов.Номенклатура = МатериалыИРаботыЗаказа.Номенклатура
	|			И МатериалыИРаботыПоВидамРемонтов.Характеристика = МатериалыИРаботыЗаказа.Характеристика
	|			И МатериалыИРаботыПоВидамРемонтов.Упаковка = МатериалыИРаботыЗаказа.Упаковка
	|			И МатериалыИРаботыПоВидамРемонтов.КодРемонта = МатериалыИРаботыЗаказа.КодРемонта
	|
	|ГДЕ
	|	МатериалыИРаботыПоВидамРемонтов.Номенклатура ЕСТЬ NULL";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("РемонтыЗаказа", РемонтыЗаказа.Выгрузить());
	Запрос.УстановитьПараметр("МатериалыИРаботыЗаказа", МатериалыИРаботыЗаказа.Выгрузить());
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	НомерСтроки = 1;
	Пока Выборка.Следующий() Цикл
	
		НоваяСтрока = Материалы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.НомерСтроки = НомерСтроки;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить(
		"ЗаполнитьПризнакХарактеристикиИспользуются",
		Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
		
	СтруктураДействий.Вставить(
		"ЗаполнитьПризнакАртикул",
		Новый Структура("Номенклатура", "Артикул"));
		
	НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(Материалы, СтруктураДействий);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеЗаказа()

	АдресДанныеЗаказа = Параметры.АдресДанныеЗаказа;
	ДанныеЗаказа = ПолучитьИзВременногоХранилища(АдресДанныеЗаказа);
	
	ОбщегоНазначенияУТКлиентСервер.ДополнитьТаблицу(ДанныеЗаказа.Ремонты, РемонтыЗаказа);
	
	ИсходнаяТаблица = ДанныеЗаказа.МатериалыИРаботы; // ТаблицаЗначений - 
	ИсходнаяТаблица.Свернуть("Номенклатура,Характеристика,Упаковка,КодРемонта", "Количество,КоличествоУпаковок");
	ОбщегоНазначенияУТКлиентСервер.ДополнитьТаблицу(ИсходнаяТаблица, МатериалыИРаботыЗаказа);
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьДанныеДляПереноса()
	
	Для каждого Строка Из Материалы Цикл
		
		Если Строка.СтрокаВыбрана Тогда
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытиемПеренестиИЗакрыть(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ПеренестиМатериалыВДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиМатериалыВДокумент()
	
	Модифицированность = Ложь;
	
	ПодготовитьДанныеДляПодбораМатериаловПоВидамРемонтов();
	
	Закрыть(АдресДанныеЗаказа);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьДанныеДляПодбораМатериаловПоВидамРемонтов()
	
	ТаблицаВыбранныхМатериалов = Материалы.Выгрузить(Новый Структура("СтрокаВыбрана", Истина));
	ПоместитьВоВременноеХранилище(ТаблицаВыбранныхМатериалов, АдресДанныеЗаказа);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВыборСтрок(ЗначениеВыбора)
	
	Для Каждого НомерСтроки Из Элементы.Материалы.ВыделенныеСтроки Цикл
		СтрокаТЧ = Материалы.НайтиПоИдентификатору(НомерСтроки);
		СтрокаТЧ.СтрокаВыбрана = ЗначениеВыбора;        
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
